app/controllers/dashboard_controller.rb

	def index

		app_common()
		@apps = App.find(:all, :order => "seq_id" )
		@host = request.host
		@host_with_port = request.host_with_port

		respond_to do |format|

			format.html {
			}
			format.rss {

			}
		    format.atom {
		    	@apps.each { |app|
---
SELECT "apps".* FROM "apps"

	def app

		app_common()
		app_name = params[:id] ? CGI::unescape( params[:id] ) :""
		apps = App.find(:all, :conditions => [ "name = ?" , app_name ] )
---
SELECT "apps".* FROM "apps" WHERE (name = 'Trapdoor Hunter')